libonvif/Remote/dpws_discovery.ProbeMatches.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
 xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
 xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
 xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
 xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
 xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">
 <SOAP-ENV:Header>
  <wsa:MessageID></wsa:MessageID>
  <wsa:RelatesTo RelationshipType=""></wsa:RelatesTo>
  <wsa:To></wsa:To>
  <wsa:Action></wsa:Action>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <wsd:ProbeMatches>
    <wsd:ProbeMatch>
     <wsa:EndpointReference>
      <wsd:Address></wsd:Address>
      <wsd:ReferenceProperties>
       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

      </wsd:ReferenceProperties>
      <wsd:ReferenceParameters>
       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

      </wsd:ReferenceParameters>
      <wsd:PortType></wsd:PortType>
      <wsd:ServiceName PortName=""></wsd:ServiceName>
      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

     </wsa:EndpointReference>
     <wsd:Types></wsd:Types>
     <wsd:Scopes MatchBy=""></wsd:Scopes>
     <wsd:XAddrs></wsd:XAddrs>
     <wsd:MetadataVersion>0</wsd:MetadataVersion>
     <!-- extensibility element(s) -->

     <!-- extensibility element(s) -->

    </wsd:ProbeMatch>
    <wsd:ProbeMatch>
     <wsa:EndpointReference>
      <wsd:Address></wsd:Address>
      <wsd:ReferenceProperties>
       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

      </wsd:ReferenceProperties>
      <wsd:ReferenceParameters>
       <!-- extensibility element(s) -->

       <!-- extensibility element(s) -->

      </wsd:ReferenceParameters>
      <wsd:PortType></wsd:PortType>
      <wsd:ServiceName PortName=""></wsd:ServiceName>
      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->

     </wsa:EndpointReference>
     <wsd:Types></wsd:Types>
     <wsd:Scopes MatchBy=""></wsd:Scopes>
     <wsd:XAddrs></wsd:XAddrs>
     <wsd:MetadataVersion>0</wsd:MetadataVersion>
     <!-- extensibility element(s) -->

     <!-- extensibility element(s) -->

    </wsd:ProbeMatch>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </wsd:ProbeMatches>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
